app/controllers/movies_controller.rb

  def index
    session[:orderBy] ||= ''
    session[:ratings] ||= Hash.new

    if((session[:orderBy] != '' && params[:orderBy].nil?) || (session[:ratings] != {} && params[:ratings].nil?))
      params[:orderBy]   ||= session[:orderBy]
      params[:ratings] ||= session[:ratings]
      redirect_to movies_path(params) and return

    end

    if !params[:orderBy].nil?
      session[:orderBy] = params[:orderBy]
    end
    if !params[:ratings].nil?
      session[:ratings] = params[:ratings]
    end

    @orderBy = params[:orderBy]
    @all_ratings = Movie.allRatings

    if params[:ratings] == nil
      @ratings = Hash[ @all_ratings.collect { |v| [v , '1'] } ]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date